using System.Collections;
using System.Collections.Generic;
using UnityEngine;

#region 코루틴
/*

▶ 코루틴 (Coroutine)

- Co + routine
ㄴ 협력하는 루틴이다.

- 일정 시간 간격을 두고 함수를 호출할 때 사용한다.
ㄴ 코루틴으은 프레임과 상관없이 별도의 서브 루틴에서 원하는 작업을 원하는 시간 만큼 수행하는 것이
가능하다.

- 코루틴이 여러 개의 서브 루틴을 생성한다고 해서 스레드와 같다고 생각을 하는데 코루틴은 "비동기"
스레드는 "동기"

가벼운 것을 선처리해주고 그 다음 무거운 것을 처리한다 -> 동기
하나의 작업을 할 때 다른 작업도 할 수 있다 -> 비동기

- 스레드와 코루틴의 가장 큰 차이점
ㄴ 스레드의 경우 lock을 걸어 우선 동기화를 시켜줘야 하지만 반면에 코루틴은 lock을 걸지 않는다.

유니티는 싱글 스레드다.
ㄴ 할 수 있는 일이 1가지

n개 이상의 프로세스는 각각 다른 기능을 가져야한다.
obj파일로 병합하는 기능은 첫번

코어: 컴퓨터가 쓸 수 있는 스레드 수
ㄴ 많으면 많을 수록 게임이 원활하게 돌아간다.
    ㄴ 스레드가 많다는 건 

컨테스팅 스위치: a한번 b 한번, 각각 순서에 맞춰 한번씩 계속 실행되는 것.
ㄴ cpu의 문제점: 컨테스팅 스위치를 할 때 속도가 너무 빨라서 a, b 각각 한번씩 실행되는게 아닌 aa, bb 이런식으로 연속으로 실행되는 경우가 있음
-> 이 문제를 해결하기 위해 lock을 걸어줌.

크리티컬 섹션이라는 영역으로 바뀐다.




 */
#endregion

public class CCoroutineExample : MonoBehaviour
{
    void Start()
    {
        
    }

    void Update()
    {
        
    }

    
}


/*
과제1. 프로젝트에 대한 기획서 작성

- 제출: 다음 주 월요일 수업전까지

--------

- 메일로 제출
- 양식을 꼭 지킨다.

- 메일 제목(양식): VR 7기_게임플랫폼 응용 프로그래밍_이름

- 첨부 파일:
ㄴ VR 7기_게임플랫폼 응용 프로그래밍_이름.zip
    ㄴ 1. 프로젝트 2. 실행파일 캡쳐
                        ㄴ 01 /  02 / 03

ㄴ VR 7기_게임명_이름.ppt (기획서)

- 메일 내용:
ㄴ 특이사항 기입

 
  능력 단위 평가 지시

- 작업 지시서 기반 프로젝트를 완성하고 제출하시오.

- 오브젝트 풀 무조건 쓰기

 
 */
